resource/request_file/Reliance_Car_Create_Lead.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
<soapenv:Header>
    <tem:UserCredential>
        <tem:UserID>RAS</tem:UserID>
        <tem:UserPassword>ril@123</tem:UserPassword>
    </tem:UserCredential>
</soapenv:Header>
<soapenv:Body>
    <tem:InsertLead>
        <tem:xmlstring>
<![CDATA[
<LEAD>
    <LEADDESCRIPTION>
        <CUSTOMERFNAME>___first_name___</CUSTOMERFNAME>
        <CUSTOMERMNAME>___middle_name___</CUSTOMERMNAME>
        <CUSTOMERLNAME>___last_name___</CUSTOMERLNAME>
        <CUSTOMERADDRESS1>___permanent_address_1___</CUSTOMERADDRESS1>
        <CUSTOMERADDRESS2>___permanent_address_2___</CUSTOMERADDRESS2>
        <CUSTOMERADDRESS3>___permanent_address_3___</CUSTOMERADDRESS3>
        <CUSTOMERCONTACTNO>___mobile___</CUSTOMERCONTACTNO>
        <CUSTOMERTELEPHONENO></CUSTOMERTELEPHONENO>
        <CUSTOMEREMAILID>___email___</CUSTOMEREMAILID>
        <VENDORCODE>13BRG488</VENDORCODE>
        <VENDORCODEVALUE>GIRNAR INSURANCE BROKERS PVT LTD - 13BRG488</VENDORCODEVALUE>
        <BASCODE>362853</BASCODE>
        <BASCODEVALUE>GAADI WEB PRIVATE LIMITED - 362853</BASCODEVALUE>
        <BASMOBILE>9871544038</BASMOBILE>
        <SMCODE>70111941</SMCODE>
        <SMCODEVALUE>Kaushlesh Mishra - 70111941</SMCODEVALUE>
        <SMMOBILENO>9871544038</SMMOBILENO>
        <VEHICLETYPE>6</VEHICLETYPE>
        <VEHICLETYPEVALUE>Pvt. Car</VEHICLETYPEVALUE>
        <VEHICLEREGNO>___registration_no___</VEHICLEREGNO><!--HR51BC1700-->
        <MAKE>___dbmaster_insurer_vehicle_make_code___</MAKE>
        <MAKEVALUE>___dbmaster_insurer_vehicle_make_name___</MAKEVALUE>
        <MODEL>___dbmaster_insurer_vehicle_model_code___</MODEL>
        <MODELVALUE>___dbmaster_insurer_vehicle_model_name___</MODELVALUE>
        <ENGINENO>___engine_number___</ENGINENO>
        <CHASSISNO>___chassis_number___</CHASSISNO>
        <STATE>___permanent_state_code___</STATE>
        <STATEVALUE>___permanent_state___</STATEVALUE>
        <DISTRICT>___permanent_district_code___</DISTRICT>
        <DISTRICTVALUE>HISAR</DISTRICTVALUE><!--___permanent_district___-->
        <CITY>___permanent_city_code___</CITY>
        <CITYVALUE>___permanent_city___</CITYVALUE>
        <PINCODE>___permanent_pincode___</PINCODE>
        <RGICL_OFFICE>1304</RGICL_OFFICE>
        <RGICL_OFFICEVALUE>Gurgaon</RGICL_OFFICEVALUE>
        <VECH_INSP_ADDRESS>___permanent_address_1___</VECH_INSP_ADDRESS>
        <VECH_INSP_ADDRESS2>___permanent_address_2___</VECH_INSP_ADDRESS2>
        <VECH_INSP_ADDRESS3>___permanent_address_3___</VECH_INSP_ADDRESS3>
        <REMARK>GZB</REMARK>
        <LEADTYPE>F</LEADTYPE>
        <STATE_VEH>___permanent_state_code___</STATE_VEH>
        <STATEVALUE_VEH>___permanent_state___</STATEVALUE_VEH>
        <DISTRICT_VEH>___permanent_district_code___</DISTRICT_VEH>
        <DISTRICTVALUE_VEH>HISAR</DISTRICTVALUE_VEH><!--___permanent_district___-->
        <CITY_VEH>___permanent_city_code___</CITY_VEH>
        <CITYVALUE_VEH>___permanent_city___</CITYVALUE_VEH>
        <PINCODE_VEH>___permanent_pincode___</PINCODE_VEH>
        <OBJECTIVEOFINSPECTION>8</OBJECTIVEOFINSPECTION>
        <OBJECTIVEOFINSPECTIONVALUE>Policy Booking</OBJECTIVEOFINSPECTIONVALUE>
        <INSPECTIONTOBEDONE>12</INSPECTIONTOBEDONE>
        <INSPECTIONTOBEDONEVALUE>Inspection Agency</INSPECTIONTOBEDONEVALUE>
        <LEADCREATEDBY>Girnar</LEADCREATEDBY>
        <LEADCREATEDBYSYSTEM>12</LEADCREATEDBYSYSTEM>
        <INTIMATORNAME>GAADI WEB PRIVATE LIMITED - 362853</INTIMATORNAME>
        <INTIMATORMOBILENO>9871544038</INTIMATORMOBILENO>
        <PREVIOUS_POLICYNUMBER />
        <BUSINESSTYPE_CODE>___vehicle_insurance_type___</BUSINESSTYPE_CODE>
    </LEADDESCRIPTION>
</LEAD>
]]>
        </tem:xmlstring>
    </tem:InsertLead>
</soapenv:Body>
</soapenv:Envelope>